# AreaTagBadViewType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..AreaTagBadViewType Property
BuiltInFailures..::..RoomFailures Class See Also
---
Can't Copy Area Tags. The target view doesn't have the same Area Scheme as the original view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AreaTagBadViewType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AreaTagBadViewType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AreaTagBadViewType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace